# 셸 기본 명령어 (basic shell commands)

## 명령 프롬프트 열기
- Window + R 누르고 cmd 검색 및 실행

## 기본 명령어 
- help : 명령 프롬프트에서 제공하는 명령어 목록 확인
- help [명령어] : 특정 명령어에 대한 자세한 도움 요청
- cls : 화면에 나타난 모든 출력 지움
- exit : 명령 프롬프트 종료
- python [경로와 파일 이름].py : 파이썬 파일 실행

## 디렉토리 관련 명령어
- cd : 현재 디렉토리 확인
- mkdir [디렉토리 이름] : 새로운 디렉토리 생성
- cd [경로] : 다른 디렉토리로 경로 변경
- cd [하위 디렉토리 이름] : 하위 디렉토리로 이동
- cd .. : 상위 디렉토리로 이동
- cd %homepath% : 홈 디렉토리로 복귀
- dir : 디렉토리 열람
- rmdir [디렉토리 이름] : 디렉토리 삭제
- del [경로와 파일 이름] : 파일 삭제
- copy [원본, 경로와 파일] [대상, 경로와 파일] : 파일 복사
